{
"filtersName": [
  {
    "id": 2,
    "name": "purchase",
    "filterClass": ".purchase"
  },
  {
    "id": 2,
    "name": "cashout",
    "filterClass": ".cashout"
  }
],

  "purchase": [
    {
      "id": 1,
      "image": "/assets/img/blog/dummy.jpg",
      "title": "Conforming",
      "title1": "Conforming",
      "tag":"A conforming loan is a mortgage that meets the purchasing guidelines set by Fannie Mae and Freddie Mac, government-sponsored enterprises (GSEs) in the US housing market. These loans adhere to specific criteria regarding loan amount, borrower qualifications, and property type. Conforming loans are a widely used mortgage option with attractive features for qualified borrowers. Here's a quick breakdown:",
      "title2":"Eligibility:",
      "li1":"Meet Fannie Mae/Freddie Mac standards.",
      "li2":"Minimum credit score (often 620+).",
      "li3":"Healthy debt-to-income ratio (ideally below 45%).",
      "li4":"Down payment (at least 3%, may vary).",
      "li5":"Loan amount under conforming loan limits (set by FHFA, $766,550 nationally in 2024, higher in some areas).",
      "title3":"Benefits:",
      "li6":"Lower Interest Rates: Due to reduced risk for lenders, conforming loans often offer competitive interest rates.",
      "li7":"Wide Availability: Most lenders provide conforming loans, making them easy to find.",
      "li8":"",
      "title4":"Considerations:",
      "li9":"Loan Limits:  Check your county limits.",
      "li10":"Not Government-Insured: Unlike FHA, VA, and USDA loans, conforming loans lack government insurance.",
      "filterclass":"purchase"
    },
    {
      "id": 2,
      "image": "/assets/img/blog/img-1.jpg",
      "title": "HomeReady",
      "title1": "Home Ready",
      "tag":"A HomeReady Mortgage is a mortgage product designed to help eligible low- to moderate-income homebuyers achieve homeownership. It's offered by lenders but backed by Fannie Mae.",
      "title2":"Eligibility:",
      "li1":"Meet income limits set for your area by Fannie Mae.",
      "li2":"Minimum credit score requirements (typically 620, but may vary).",
      "li3":"Healthy debt-to-income ratio (ideally below 45%).",
      "li4":"Down payment of at least 3%.",
      "li5":"Completion of a homeownership education course approved by Fannie Mae.",
      "title3":"Benefits:",
      "li6":"Lower down payment: Compared to conventional loans, HomeReady allows a down payment as low as 3%.",
      "li7":"Competitive interest rates: Due to government backing, HomeReady loans often offer attractive rates.",
      "li8":"Flexible qualifying factors: Income limits and credit score requirements can be more forgiving compared to conventional loans.",
      "title4":"Considerations",
      "li9":"Income limits: You must meet the income eligibility for your area.",
      "li10":"Homeownership education: Completing a homeownership course is mandatory.",
       "filterclass":"purchase"
      
    },
    {
      "id":3,
      "title":"HomePossible",
      "title1":"Home Possible",
      "tag":"The Home Possible is a Fannie Mae program designed to expand homeownership opportunities for creditworthy borrowers with moderate income.",
      "title2":"Eligibility:",
      "li1":"Income Limits: Your income cannot exceed a specific percentage (typically 80%) of the Area Median Income (AMI) for the location of the property you wish to purchase.",
      "li2":"Credit Score: Minimum credit score requirements vary, but can be as low as 620 with a slightly higher rate.",
      "li3":"Debt-to-Income Ratio: A healthy debt-to-income ratio is preferred, though flexibility may exist compared to conventional loans.",
      "li4":"Down Payment: A minimum down payment of 3% is required. Funds can come from various sources, including gifts and grants.",
      "li5":"Property Type: Must be a primary residence (single-unit dwelling).",
      "title3":"Benefits:",
      "li6":"Lower Down Payment: Requires a smaller down payment compared to conventional loans.",
      "li7":"Competitive Rates: Offers attractive interest rates due to reduced risk for lenders.",
      "li8":"Flexible Qualifying Factors: Income limits and credit score requirements can be more lenient than traditional options.",
      "title4":"Considerations:",
      "li9":"Income Limits: You must meet the income restrictions for the area where you're buying.",
      "li10":"Property Usage: Limited to single-unit primary residences.",
      "li11":"Geographic Restrictions: No geographic limitations on loan amounts, but income limits vary by location.",
       "filterclass":"purchase"
    },
    {
      "id":4,
      "title":"ConformingArm",
      "title1":"Conforming ARM (Adjustable Rate Mortgage)",
      "tag":"A Conforming ARM (Adjustable Rate Mortgage) combines the features of a traditional Adjustable-Rate Mortgage (ARM) with the eligibility standards set by Fannie Mae and Freddie Mac for conforming loans. In simpler terms, it's a mortgage with an interest rate that adjusts over time, but adheres to borrowing guidelines established by these government-sponsored enterprises (GSEs) to ensure a certain level of stability in the housing market.",
      "title2":"Eligibility:",
      "li1":"Meets Fannie Mae/Freddie Mac conforming loan guidelines (loan amount limits, credit score, debt-to-income ratio, etc.).",
      "li2":"Minimum credit score requirements (often 620+).",
      "li3":"Healthy debt-to-income ratio (ideally below 45%).",
      "li4":"Down payment (at least 3%, may vary).",
      "li5":"",
      "title3":"Benefits:",
      "li6":"Potentially Lower Initial Rates: Compared to fixed-rate conforming loans, ARMs may offer lower introductory rates.",
      "li7":"Flexibility: Can be a good option if you plan to sell the home before the fixed-rate period ends.",
      "li8":"",
      "title4":"Considerations:",
      "li9":"Interest Rate Risk: After the initial fixed period, your monthly payment can fluctuate due to interest rate adjustments.",
      "li10":"Long-Term Planning: ARMs may not be suitable for long-term ownership plans if you're concerned about rising rates.",
      "li11":"Understanding the Product: It's crucial to understand the ARM's terms, including adjustment frequency, caps, and potential payment increases.",
       "filterclass":"purchase"
    },
    {
      "id":5,
      "title":"RefiNow",
      "title1":"Refi Now",
      "tag":"RefiNow is a mortgage refinancing program created by Fannie Mae to help eligible homeowners reduce their monthly housing costs. It specifically targets those who may not qualify for traditional refinance options due to factors like credit score or income level.",
      "title2":"Eligibility:",
      "li1":"The mortgage you're looking to refinance needs to be currently owned or guaranteed by Fannie Mae.",
      "li2":"Income limits apply (must be at or below 100% of the Area Median Income (AMI) for your location).",
      "li3":"Minimum credit score not required. No recent delinquencies on your current mortgage.",
      "li4":"Debt-to-income ratio (DTI) must be less than or equal to 65%.",
      "li5":"Refinancing a single-unit principal residence. Maximum loan-to-value (LTV) ratio limits apply (typically 95%).",
      "title3":"Benefits:",
      "li6":"Reduced Interest Rate: RefiNow requires a minimum interest rate reduction of 50 basis points (0.5%) compared to your current mortgage, potentially leading to significant monthly savings.",
      "li7":"Lower Monthly Payment: The program aims to help you achieve a lower monthly payment, making home ownership more affordable.",
      "li8":"More Flexible Eligibility: Compared to traditional refinances, RefiNow offers broader eligibility with a focus on income and making homeownership more sustainable.",
      "title4":"Considerations:",
      "li9":"Income Limits: You must meet the income limitations set for your area to qualify.",
      "li10":"No Minimum Credit Score: While a minimum credit score isn't required, other factors like credit history and debt may be considered.",
       "filterclass":"purchase"

    },
    {
      "id": 6,
      "image": "/assets/img/blog/img-1.jpg",
      "title": "RefiPossible",
      "title1": "Refi Possible",
      "tag":"RefiPossible is a mortgage refinancing program created by Freddie Mac to help low- and moderate-income homeowners reduce their monthly housing costs. It caters to borrowers who may not qualify for traditional refinances due to income limitations.",
      "title2":"Eligibility:",
      "li1":"The mortgage you're looking to refinance needs to be currently owned or guaranteed by Freddie Mac.",
      "li2":"Income limits apply (typically at or below 80% of the Area Median Income (AMI) for your location).",
      "li3":"Minimum credit score requirements vary, but can be as low as 620 with a slightly higher rate.",
      "li4":"No recent delinquencies on your current mortgage. Debt-to-income ratio (DTI) up to 65% may be considered.",
      "li5":"Refinancing a single-unit principal residence. Maximum loan-to-value (LTV) ratio limits apply (typically up to 97%).",
      "title3":"Benefits:",
      "li6":"Reduced Interest Rate: RefiPossible aims to help you achieve a lower interest rate compared to your current mortgage, potentially leading to significant monthly savings.",
      "li7":"Lower Monthly Payment: The program's goal is to make homeownership more affordable by reducing your monthly payment.",
      "li8":"More Flexible Eligibility: RefiPossible offers broader eligibility compared to conventional refinances, focusing on income and making housing costs more manageable.",
      "title4":"Considerations:",
      "li9":"Income Limits: You must meet the income limitations set for your area to qualify.",
      "li10":"Credit Score: While the minimum credit score can be lower than traditional options, it's still a factor.",
      "filterclass":"purchase"
    },
    {
      "id": 7,
      "image": "/assets/img/blog/dummy.jpg",
      "title": "CONFORMINGCASH-OUTREFINANCE ",
      "title1": "CONFORMING CASH-OUT REFINANCE",
      "tag":"A conforming cash-out refinance is a type of cash-out refinance that meets the purchasing guidelines set by Fannie Mae and Freddie Mac, the government-sponsored enterprises (GSEs) in the US housing market.  This allows you to refinance your existing mortgage for a higher amount than you currently owe and receive the difference in cash, while adhering to specific criteria established by the GSEs.",
      "title2":"Eligibility:",
      "li1":"Meets Fannie Mae/Freddie Mac standards for cash-out refinances.",
      "li2":"These standards may be similar to, but not necessarily identical to, those for conforming purchase loans.",
      "li3":"Minimum credit score (often 620+).",
      "li4":"Healthy debt-to-income ratio (ideally below 45%).",
      "li5":"requirements may vary depending on lender and loan.",
      "title3":"Benefits (if conforming cash-out refinance existed):",
      "li6":"Potentially lower interest rates compared to other cash-out options (due to conforming loan benefits).",
      "li7":"Wide lender availability (similar to conforming loans).",
      "li8":"",
      "title4":"Considerations (if conforming cash-out refinance existed):",
      "li9":"Loan limits would still apply (same as conforming loan limits).",
      "li10":"You would need to meet conforming loan eligibility requirements (credit score, debt-to-income ratio, etc.).",
       "filterclass":"cashout"
    }
  ]
  
}