[
  {
    "id": 1,
    "image": "/assets/img/msj-reviews/Kevin.png",
    "content": "I’ve been working with San Jose mortgage for about 2 months now I had issues with my license on my end and instead of just leaving me out there to deal with it my self and San Jose mortgage worked with me a HUGE shout thanks to Cinthya Vega she is amazing! she followed up with me every step of the way and helped me so much when I was lost.",
    "username": "Kevin Martinez"
  },
  {
    "id": 2,
    "image": "/assets/img/msj-reviews/Lexie.png",
    "content": "I’m a new lo and I had a decent delay with my license approval. It was pretty discouraging but Cinthya checked up on me and with her relatable and professional responses, it kept me super excited and She was amazing and stayed consistent with me, keeping the same energy level which helped me out so much during the process. I couldn’t be more grateful to her!",
    "username": "Lexie "
  },
  {
    "id": 3,
    "image": "/assets/img/msj-reviews/Siddhartha.png",
    "content": "Omar helped me get loan to buy my first home. He is professional, sincere in his work, and overall a friendly person. I liked the fact that he was quick to respond to emails and text messages. He helped me throughout the house hunt process, discussions on home buying and it's various facets in one's life. Overall, I am happy to strongly recommend Omar.",
    "username": "Siddartha Chattopadhyay"
  },
  {
    "id": 4,
    "image": "/assets/img/msj-reviews/Ramyakanth.png",
    "content": "I have worked with Omar for 4 times so far on multiple properties.  Omar is very knowledgeable on the home mortgage and very straight forward in his approach.  Omar goes extra mile to make sure all the process is in place and loan is processed successfully.  Omar is personally very straight forward, honest.  I strongly recommend Omar to use his service for Home Mortgage.!",
    "username": "Ramyakanth Edupuganti"
  },
  {
    "id": 5,
    "image": "/assets/img/msj-reviews/Carlos.png",
    "content": "This company offers a wide variety of products for homeownership, as well as amazing customer support. Cinthya was very instrumental in helping me get my license approved. A lot of communication and follow up that were needed to get things done. Thank you!",
    "username": "Carlos Guevara"
  },
  {
    "id": 6,
    "image": "/assets/img/msj-reviews/Steven.png",
    "content": "I’m a new lo and I had a decent delay with my license approval. It was pretty discouraging but Cinthya checked up on me and with her relatable and professional responses, it kept me super excited and motivated! She was amazing and keeping the same energy level which helped me out so much during the process. I couldn’t be more grateful to her.!",
    "username": "Steven "
  },
  {
    "id": 7,
    "image": "/assets/img/msj-reviews/Derek.png",
    "content": "I’m a current employee of Mission San Jose Mortgage and have been with the company for about 4 months now. Mission San Jose Mortgage will always have a special place in my heart bc they were the first company to give me a shot. They help me prepare for my NMLS exam and we passed it on the first shot!",
    "username": "Derek Mass"
  },
  {
    "id": 8,
    "image": "/assets/img/msj-reviews/Sarai.png",
    "content": "Cinthya, the concierge at Mission San Jose Mortgage was extremely helpful in getting my MLO License sponsored. She was patient with me and made time to answer whatever question I had in regard to the process. If you need anything she will make an effort to help you out or find someone who can. I would recommend her 100%.",
    "username": "Sarai Rivera"
  },
  {
    "id": 9,
    "image": "/assets/img/msj-reviews/Hope.png",
    "content": "Thank you so very much for all of your help in securing my loan for my new home here in Stockton . You guys were organized & friendly & professional, as well as kind which made all of the difference in my interactions with you and your team. Thank you for your patience as well as treating me as a person rather than just a home loan customer.  Thank you for making my dream come true of providing a home for my family.",
    "username": "Hope Lopez"
  },
  {
    "id": 10,
    "image": "/assets/img/msj-reviews/Farnaz.png",
    "content": "My experience with Mission Mortgage was about the most professional, efficient and pleasant events. this loan process with Mission Mortgage was one of the most honest, efficient and pleasant buying experience I've had in my life and trust me I've had the opportunity and time to have had many buying experiences both with homes .I personally think anyone who chooses Mission Mortgage as their mortgage company would have made an astute business decision.",
    "username": "Farnaz Torania"
  },
  {
    "id": 11,
    "image": "/assets/img/msj-reviews/Sarfaraz.png",
    "content": "Highly recommend Mission San Jose Mortgage. Omar has been a trusted resource for me every time I've made a home buying or refinance decision. Very knowledgable about the industry and the service has been great.",
    "username": "Sarfaraz Rydhan"
  },
  {
    "id": 12,
    "image": "/assets/img/msj-reviews/Imran.png",
    "content": "My experience with Mission San Jose Mortgage was what I was looking for, straight to the point, fast, and very helpful. I recommend them to anyone who looking to get their first Home. Thank you for making it easy for me.",
    "username": "Mohammad Imran"
  },
  {
    "id": 13,
    "image": "/assets/img/msj-reviews/Michael.png",
    "content": "Came to Mission San Jose Mortgage after my clients deal fell through with another lender. Bon was very professional and helped guide my buyer's through the process. Deal closed today, and my buyer's have their dream home. Thanks Bon for all your hard work. Michael RE agent.",
    "username": "Michael Falls"
  },
  {
    "id": 14,
    "image": "/assets/img/msj-reviews/Jayden.png",
    "content": "What a wonderful team MSJ is the place to go if you need to refinance or purchase a home. Omar has so much knowledge and is great to work with, he will close your loans. Thanks for everything Omar hope to work with you sooner than later. A + +",
    "username": "Jayden Bella"
  },
  {
    "id": 15,
    "image": "/assets/img/msj-reviews/Angel.png",
    "content": "Philip was a huge help. The underwriting has gotten a lot stricter in recent years and Philip was very professional thorough and stuck with me until closing. I recommend Philip Kilmer at Mission San Jose Mortgage.",
    "username": "Angel Moralez"
  },
  {
    "id": 16,
    "image": "/assets/img/msj-reviews/Joth.png",
    "content": "Ramanjeet was very helpful in the refinance process. She guided us and even came to get the paperwork. She went above and beyond to get us the best rate. I would definitely refer her to friends and family.",
    "username": "Joth Jeerh"
  },
  {
    "id": 17,
    "image": "/assets/img/msj-reviews/Salvador.png",
    "content": "Bon Sun, did an excellent job during the loan process and always kept the buyers and agents informed, very professional lending team! I highly recommend Mission San Jose mortgage of Stockton.",
    "username": "Salvador Martinez"
  },
  {
    "id": 18,
    "image": "/assets/img/msj-reviews/Anthony.png",
    "content": "I have used Mission San Jose Mortgage for my home and investment properties, specifically Omar Khamisa. Very knowledgeable team, great customer service, I highly recommend Mission San Jose Mortgage.",
    "username": "Anthony Wofford"
  },
  {
    "id": 19,
    "image": "/assets/img/msj-reviews/Kim.png",
    "content": "Being able to have Philip Kilmer help me get my first home was an amazing experience. He made everything so easy to understand. He also went above and beyond to help me save.  Would 100% highly recommend his service!!",
    "username": "Kim Chhim"
  },
  {
    "id": 20,
    "image": "/assets/img/msj-reviews/Ron.png",
    "content": "Omar and his wonderful staff, Bon And Huiyan were very professional.  They were all very helpful and knowledgeable,  making the whole refi a wonderful experience for us.  I would certainly recommend them to anyone looking to refinance or buy a home!",
    "username": "Ron H"
  },
  {
    "id": 21,
    "image": "/assets/img/msj-reviews/Sally.png",
    "content": "Mission San Jose mortgage can handle anything in the last minute. Omar and staff Deliver excellent and provide an extra mile service. I highly recommend, and Sally Dauz BHHS DRYSDALE .",
    "username": "Sally Dauz"
  },
  {
    "id": 22,
    "image": "/assets/img/msj-reviews/Tony.png",
    "content": "Overall a great place to work.  Cinthya has been a tremendous help with licensing. Training and support has been awesome.  We are all eager to go the extra mile. Its a pleasure to work with such a dedicated group.",
    "username": "Tony Conner"
  },
  {
    "id": 23,
    "image": "/assets/img/msj-reviews/Jagit.png",
    "content": "raelene mellinger, did an excellent job during the process of paperwork. she is very professional and knowledgeable. she deserves a big raise for all her hardwork. it was the best experience that i have ever had. thank you making this easy for me.",
    "username": "Jagit Singh (JAG)"
  },
  {
    "id": 24,
    "image": "/assets/img/msj-reviews/Jasminder.png",
    "content": "I work with Ramanjeet Kaur in refiance my house. she worked hard in order to get my loan approved. she td me every detail and help me to understand the loan process. I'm thankful to Mission San Jose Mortgage for wonderful services",
    "username": "Jasminder Chima"
  },
  {
    "id": 25,
    "image": "/assets/img/msj-reviews/Broker.png",
    "content": "Awesome group of Professionals! They go above and beyond for the client! I have worked with many Lenders over the years and Mission mortgage is at the Top of my list!",
    "username": "Broker Associate Christina"
  },
  {
    "id": 26,
    "image": "/assets/img/msj-reviews/Elizabeth.png",
    "content": "We can't think Omar and his team enough for the dedicated long and hard work on what had to been the most confusing, delicate.  Omar's above and beyond work has been exceptional.",
    "username": "Elizabeth Baker"
  },
  {
    "id": 27,
    "image": "/assets/img/msj-reviews/Zulfiqar.png",
    "content": "Qaiser ullah help to go get pre approved loan for the house in Stockton He done hard and great job for me He is the greatest loan officer if anyone have any question about loan or too get the loan I will recommend Qaiser ullah to everyone He got me the best interest rate compare then others. Thank you Qaiser Bahi I really appreciate that",
    "username": "Zulfiqar Ahmed"
  },
  {
    "id": 28,
    "image": "/assets/img/msj-reviews/Cinema.png",
    "content": "I have worked with San Jose Mortage on 2 occasions and both times things went flawlessly thanks to Qaiser. I always got the best rate on the market and Qaiser was always available whenever I had any concerns. I would highly recommend MMS and ask for Qaiser for any of your loan needs. He will take care of you.",
    "username": "Z Cinema"
  },
  {
    "id": 29,
    "image": "/assets/img/msj-reviews/Richard.png",
    "content": "Raelene Mellinger went above and beyond our expectations during our home purchase process. Answered every question we had promptly and professionally. I recommend her to anyone!!!",
    "username": "Richard Gutierrez"
  },
  {
    "id": 30,
    "image": "/assets/img/msj-reviews/Danny.png",
    "content": "Huiyan was the Biggest Help Ever. She Deserves a Serious Raise for All Her Hard Work and Total Kindness. It was a Please working with Huiyan. Omar, You need to give Huiyan a Big, Big, Big Raise! Thank You Kindly :) .!",
    "username": "Danny Martinez"
  },
  {
    "id": 31,
    "image": "/assets/img/msj-reviews/Danny.png",
    "content": "Cynthia is amazing she was with me every step of the way in my licensing process thank you Cynthia.!",
    "username": "Danny Martinez"
  },
  {
    "id": 32,
    "image": "/assets/img/msj-reviews/Jayveon.png",
    "content": "5/5 Stars. Special thank you to Omar Khamisa and Cinthya Vega for going above and beyond to help me get licensed.!",
    "username": "Jayvoun Chark"
  },
  {
    "id": 33,
    "image": "/assets/img/msj-reviews/Shushu.png",
    "content": "omar khamis  helped me to refinance my home he the best  mortgage broker any one looking  for broker don't go anywhere omer is the right man. Thank you very much omar  khamisa",
    "username": "Shusha Dua"
  },
  {
    "id": 34,
    "image": "/assets/img/msj-reviews/Tomas.png",
    "content": "It has been a great experience buying my house with this group of professionals. They make the process easier. We closed way before expecting time thank you  mission San Jose mortgage",
    "username": "Tomas Luna"
  }
]
